/***********************************************
  グローバル変数
************************************************/
//カードの山（配列）
//自分のカード（配列）
//相手のカード（配列）
//勝敗判定フラグ（論理型）

/***********************************************
  イベントハンドラの割り当て
************************************************/
//ページ読み込み時の初期処理
window.addEventListener("load", 初期表示);


//「カードを引く」ボタン押下時の処理
document.querySelector("ボタンのID").addEventListener("click", カードを引く);


//「勝負する！」ボタン押下時の処理



//「もう１回遊ぶ」ボタン押下時の処理

/***********************************************
  イベントハンドラ
************************************************/
//ページ読み込み時の初期処理
function 初期処理() {
  //自分がカードを引く
  //相手がカードを引く
  //画面を更新する
}

//「カードを引く」ボタン押下時の処理
function カードを引く(){
  //自分がカードを引く
  //相手がカードを引く
  //画面を更新する
}

//「勝負する！」ボタン押下時の処理
function 勝負する(){
  //勝敗を判定する
  //勝敗を画面に表示する
}

//「もう１回遊ぶ」ボタン押下時の処理
function もう1回遊ぶ(){
  //画面を初期表示に戻す
}


/***********************************************
  ゲーム関数
************************************************/

/***********************************************
  デバッグ関数
************************************************/
